"""Задание 3. Создать список и заполнить его элементами различных типов данных.
Реализовать проверку типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

Пример:
для списка [5, "string", 0.15, True, None]
результат

<class 'int'>
<class 'str'>
<class 'float'>
<class 'bool'>
<class 'NoneType'>"""


list = [7, 2, True, [6,7], "Hi", {"work": "IT"},(5,0)]
for i in range (len(list)) :
    print(f"Тип: {type(list[i])}")


